package com.itheima.day02.code02;

/**
 * Created by Jason on 2020/10/6 13:08
 */
public class Main {
    /**
     *  一个机动车管理系统中有以下类的设计：
     *
     * ​    机动车类：
     *
     * ​       |--汽车类：
     *
     * ​           |--奔驰车
     *
     * ​           |--宝马车
     *
     * ​       |--摩托车类：
     *
     * ​           |--雅马哈摩托
     *
     * ​           |--宝马摩托
     *
     * ​    所有的车都有如下信息：
     *
     * l 属性：品牌、价格
     *
     * l 行为：运行
     *
     * 现在要求为所有“宝马车系”的汽车增加一个GPS功能。
     *
     * **要求**
     *
     * ​    请设计出上述的类结构，并用代码实现。
     */
}
